using System;

namespace HomeTask1
{
    class Program
    {
        static void Main(string[] args)
        {

            /* Задание № 4

             Cравнение time и null в выражении if не являются валидными.
             Потому что, значение null это пустота (если переменным ссылочного
            типа не присваивается значение, то им дается значение по умолчанию - значение null.
            Фактически оно говорит об отстутсвии значения как такового.но типы значений, например,
            int, decimal, double и т.д. не могут принимать значение null.). А метод DataTime() 
             представляет дату и время от 00:00:00 1 января 0001 года до
             23:59:59 31 декабря 9999 года, а это уже является каким-то значением.

             */
        }
    }
}
